cask_args appdir: '/Applications'

# Tap Repo
tap 'caskroom/versions'
tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'acme'
brew 'ag'
brew 'awscli'
brew 'certbot'
brew 'findutils'
brew 'fzf'
brew 'git'
brew 'git-flow'
brew 'hadolint'
brew 'httpie'
brew 'htop'
brew 'kops'
brew 'kustomize'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'mackup'
brew 'mtr'
brew 'mysql'
brew 'mysql-client'
brew 'ncdu'
brew 'nvim'
brew 'pwgen'
brew 'shellcheck'
brew 'siege'
brew 'stormssh'
brew 'the_silver_searcher'
brew 'rbenv'
brew 'terraform'
brew 'tree'
brew 'tsung'
brew 'wget'
brew 'iftop'
brew 'iperf'
brew 'jq'
brew 'xml2'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

cask 'alfred'
cask 'appzapper'
cask 'authy'
cask 'bartender'
cask 'betterzip'
cask 'caffeine'
cask 'datagrip'
cask 'docker'
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'flux'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'forticlient'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'haptic-touch-bar'
cask 'iterm2'
cask 'kaleidoscope'
cask 'karabiner-elements'
cask 'keepassxc'
cask 'keycastr'
cask 'keycastr'
cask 'kite'
cask 'kubernetic'
cask 'macdown'
cask 'nox-app-player'
cask 'postman'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'teamsql'
cask 'telegram-desktop'
cask 'transmission'
cask 'transmit4'
cask 'visual-studio-code'

# Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'webpquicklook'
cask 'suspicious-package'
cask 'qlvideo'
